{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.2,
  "hidden_dim": 3072,
  "id2label": {
    "0": "calendar_event",
    "1": "get_date",
    "2": "get_directions",
    "3": "get_time",
    "4": "get_weather",
    "5": "play_music",
    "6": "set_alarm",
    "7": "set_reminder",
    "8": "set_timer",
    "9": "web_search"
  },
  "initializer_range": 0.02,
  "label2id": {
    "calendar_event": 0,
    "get_date": 1,
    "get_directions": 2,
    "get_time": 3,
    "get_weather": 4,
    "play_music": 5,
    "set_alarm": 6,
    "set_reminder": 7,
    "set_timer": 8,
    "web_search": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "vocab_size": 30522
}
